# Limpieza BBDD:

1. actor.csv

In [26]:
%pip install ipython
%pip install seaborn

Requirement already satisfied: ipython in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (8.2.0)
Requirement already satisfied: appnope in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (0.1.2)
Requirement already satisfied: matplotlib-inline in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (0.1.2)
Requirement already satisfied: pygments>=2.4.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (2.11.2)
Requirement already satisfied: setuptools>=18.5 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (61.2.0)
Requirement already satisfied: pexpect>4.3 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (4.8.0)
Requirement already satisfied: pickleshare in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (0.7.5)
Requirement already satisfied: traitlets>=5 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (5.1.1)
Requirement already satisfied: backcall in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (0.2.0)
Requirement already satisfied: decorator in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (5.1.1)
Requirement already satisfied: stack-data in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (0.2.0)
Requirement already satisfied: jedi>=0.16 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (0.18.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from ipython) (3.0.20)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython) (0.7.0)
Requirement already satisfied: wcwidth in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython) (0.2.5)
Requirement already satisfied: pure-eval in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython) (0.2.2)
Requirement already satisfied: executing in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython) (0.8.3)
Requirement already satisfied: asttokens in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython) (2.0.5)
Requirement already satisfied: six in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from asttokens->stack-data->ipython) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (0.11.2)
Requirement already satisfied: scipy>=1.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (1.7.3)
Requirement already satisfied: matplotlib>=2.2 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (3.5.1)
Requirement already satisfied: pandas>=0.23 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (1.4.2)
Requirement already satisfied: numpy>=1.15 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (1.21.5)
Requirement already satisfied: pyparsing>=2.2.1 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (3.0.4)
Requirement already satisfied: pillow>=6.2.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (9.0.1)
Requirement already satisfied: fonttools>=4.22.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (4.25.0)
Requirement already satisfied: cycler>=0.10 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: python-dateutil>=2.7 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (1.3.2)
Requirement already satisfied: packaging>=20.0 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: pytz>=2020.1 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from pandas>=0.23->seaborn) (2021.3)
Requirement already satisfied: six>=1.5 in /Users/maria/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [27]:
# librerias

import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')


# para pintar
import pylab as plt
import seaborn as sns

#para que salga el grafico
%matplotlib inline

In [28]:
# se cargan datos

actor_ori=pd.read_csv('w3-database-project/data/actor.csv')

actor=actor_ori.copy()

actor.head()

   actor_id first_name     last_name          last_update                 name
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2       NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3         ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [29]:
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     199 non-null    int64
 1   first_name   199 non-null    object
 2   last_name    199 non-null    object
 3   last_update  199 non-null    object
 4   name         199 non-null    object
dtypes: int64(1), object(4)
memory usage: 54.4 KB

In [30]:
for c in actor.select_dtypes('integer').columns:
    
    actor[c]=pd.to_numeric(actor[c], downcast='integer')
    
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     199 non-null    int16
 1   first_name   199 non-null    object
 2   last_name    199 non-null    object
 3   last_update  199 non-null    object
 4   name         199 non-null    object
dtypes: int16(1), object(4)
memory usage: 53.2 KB

In [31]:
actor["name"] = actor["first_name"] + ' ' + actor["last_name"]

In [32]:
actor.head()

   actor_id first_name     last_name          last_update                 name
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2       NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3         ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [33]:
nan_cols=actor.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [34]:
actor.drop_duplicates().shape==actor.shape

True

In [35]:
actor.name.drop_duplicates().shape

(199,)

In [36]:
actor.name.shape

(199,)

In [37]:
actor.drop_duplicates('name', inplace=True)

In [38]:
actor.shape

(199, 5)

In [39]:
actor.to_csv('w3-database-project/data/actor.csv',sep=',',index=False)

2. category.csv

In [40]:
# se cargan datos

category_ori=pd.read_csv('w3-database-project/data/category.csv')

category=category_ori.copy()

category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [41]:
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [42]:
for c in category.select_dtypes('integer').columns:
    
    category[c]=pd.to_numeric(category[c], downcast='integer')
    
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int8
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int8(1), object(2)
memory usage: 2.3 KB

In [43]:
nan_cols=category.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [44]:
category.drop_duplicates().shape==category.shape

True

In [45]:
category.to_csv('w3-database-project/data/category.csv',sep=',',index=False)

3. film.csv

In [46]:
# se cargan datos

film_ori=pd.read_csv('w3-database-project/data/film.csv')

film=film_ori.copy()

film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [47]:
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
 11  last_update       1000 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 487.5 KB

In [48]:
for c in film.select_dtypes('integer').columns:
    
    film[c]=pd.to_numeric(film[c], downcast='integer')
    
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int16
 4   language_id       1000 non-null   int8
 5   rental_duration   1000 non-null   int8
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int16
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
 11  last_update       1000 non-null   object
dtypes: float64(2), int16(3), int8(2), object(5)
memory usage: 456.2 KB

In [49]:
for c in film.select_dtypes('float').columns:
    
    film[c]=pd.to_numeric(film[c], downcast='float')
    
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int16
 4   language_id       1000 non-null   int8
 5   rental_duration   1000 non-null   int8
 6   rental_rate       1000 non-null   float32
 7   length            1000 non-null   int16
 8   replacement_cost  1000 non-null   float32
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
 11  last_update       1000 non-null   object
dtypes: float32(2), int16(3), int8(2), object(5)
memory usage: 448.4 KB

In [50]:
film.drop(columns='original_language_id', inplace=True)

KeyError: "['original_language_id'] not found in axis"

In [51]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [102]:
old_HDD=old_HDD.set_index('title').join(film.set_index('title'), lsuffix='_HDD', rsuffix='_film').reset_index()

In [105]:
old_HDD.drop(columns=['description', 'release_year_film', 'language_id','rental_duration','rental_rate','length','replacement_cost','rating','special_features','last_update'], inplace=True)

In [106]:
old_HDD. columns = ['title','name','first_name', 'last_name', 'release_year', 'category_id','actor_id','film_id']

In [107]:
old_HDD.head()

,title,name,first_name,last_name,release_year,category_id,actor_id,film_id
0,ACADEMY DINOSAUR,CHRISTIAN GABLE,CHRISTIAN,GABLE,2006,6,10,1
1,ACADEMY DINOSAUR,LUCILLE TRACY,LUCILLE,TRACY,2006,6,20,1
2,ACADEMY DINOSAUR,PENELOPE GUINESS,PENELOPE,GUINESS,2006,6,1,1
3,ACADEMY DINOSAUR,SANDRA PECK,SANDRA,PECK,2006,6,30,1
4,ACE GOLDFINGER,BOB FAWCETT,BOB,FAWCETT,2006,11,19,2

In [52]:
nan_cols=film.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [53]:
film.drop_duplicates().shape==film.shape

True

In [54]:
film.to_csv('w3-database-project/data/film.csv',sep=',',index=False)

4. inventory.csv

In [55]:
# se cargan datos

inventory_ori=pd.read_csv('w3-database-project/data/inventory.csv')

inventory=inventory_ori.copy()

inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [56]:
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [57]:
for c in inventory.select_dtypes('integer').columns:
    
    inventory[c]=pd.to_numeric(inventory[c], downcast='integer')
    
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int16
 1   film_id       1000 non-null   int16
 2   store_id      1000 non-null   int8
 3   last_update   1000 non-null   object
dtypes: int16(2), int8(1), object(1)
memory usage: 79.2 KB

In [58]:
nan_cols=inventory.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [59]:
inventory.drop_duplicates().shape==inventory.shape

True

In [60]:
inventory.to_csv('w3-database-project/data/inventory.csv',sep=',',index=False)

5. language.csv

In [61]:
# se cargan datos

language_ori=pd.read_csv('w3-database-project/data/language.csv')

language=language_ori.copy()

language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [62]:
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [63]:
for c in language.select_dtypes('integer').columns:
    
    language[c]=pd.to_numeric(language[c], downcast='integer')
    
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int8
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int8(1), object(2)
memory usage: 974.0 bytes

In [64]:
nan_cols=language.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [65]:
language.drop_duplicates().shape==language.shape

True

In [66]:
language.to_csv('w3-database-project/data/language.csv',sep=',',index=False)

6. old_HDD.csv

In [67]:
# se cargan datos

old_HDD_ori=pd.read_csv('w3-database-project/data/old_HDD.csv')

old_HDD=old_HDD_ori.copy()

old_HDD.head()

,first_name,last_name,title,release_year,category_id,name
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS

In [68]:
old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
 5   name          1000 non-null   object
dtypes: int64(2), object(4)
memory usage: 275.1 KB

In [69]:
for c in old_HDD.select_dtypes('integer').columns:
    
    old_HDD[c]=pd.to_numeric(old_HDD[c], downcast='integer')
    
old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int16
 4   category_id   1000 non-null   int8
 5   name          1000 non-null   object
dtypes: int16(1), int8(1), object(4)
memory usage: 262.4 KB

In [70]:
old_HDD["name"] = old_HDD["first_name"] + ' ' + old_HDD["last_name"]

In [87]:
old_HDD=old_HDD.set_index('name').join(actor.set_index('name'), lsuffix='_HDD', rsuffix='_actor').reset_index()

In [88]:
old_HDD.head()

,name,first_name_HDD,last_name_HDD,title,release_year,category_id,actor_id,first_name_actor,last_name_actor,last_update
0,ALEC WAYNE,ALEC,WAYNE,ALADDIN CALENDAR,2006,15,29,ALEC,WAYNE,2006-02-15 04:34:33
1,ALEC WAYNE,ALEC,WAYNE,BLADE POLISH,2006,7,29,ALEC,WAYNE,2006-02-15 04:34:33
2,ALEC WAYNE,ALEC,WAYNE,BULL SHAWSHANK,2006,1,29,ALEC,WAYNE,2006-02-15 04:34:33
3,ALEC WAYNE,ALEC,WAYNE,CABIN FLASH,2006,3,29,ALEC,WAYNE,2006-02-15 04:34:33
4,ALEC WAYNE,ALEC,WAYNE,CENTER DINOSAUR,2006,4,29,ALEC,WAYNE,2006-02-15 04:34:33

In [94]:
old_HDD.drop(columns=['first_name_actor','last_name_actor','last_update'], inplace=True)

KeyError: "['first_name_actor', 'last_name_actor', 'last_update'] not found in axis"

In [95]:
old_HDD.head()

,name,first_name_HDD,last_name_HDD,title,release_year,category_id,actor_id
0,ALEC WAYNE,ALEC,WAYNE,ALADDIN CALENDAR,2006,15,29
1,ALEC WAYNE,ALEC,WAYNE,BLADE POLISH,2006,7,29
2,ALEC WAYNE,ALEC,WAYNE,BULL SHAWSHANK,2006,1,29
3,ALEC WAYNE,ALEC,WAYNE,CABIN FLASH,2006,3,29
4,ALEC WAYNE,ALEC,WAYNE,CENTER DINOSAUR,2006,4,29

In [97]:
old_HDD. columns = ['name','first_name', 'last_name', 'title', 'release_year', 'category_id','actor_id']

In [98]:
old_HDD.head()

,name,first_name,last_name,title,release_year,category_id,actor_id
0,ALEC WAYNE,ALEC,WAYNE,ALADDIN CALENDAR,2006,15,29
1,ALEC WAYNE,ALEC,WAYNE,BLADE POLISH,2006,7,29
2,ALEC WAYNE,ALEC,WAYNE,BULL SHAWSHANK,2006,1,29
3,ALEC WAYNE,ALEC,WAYNE,CABIN FLASH,2006,3,29
4,ALEC WAYNE,ALEC,WAYNE,CENTER DINOSAUR,2006,4,29

In [72]:
nan_cols=old_HDD.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [73]:
old_HDD.drop_duplicates().shape==old_HDD.shape

True

In [108]:
old_HDD.to_csv('w3-database-project/data/old_HDD.csv',sep=',',index=False)

7. rental.csv

In [75]:
# se cargan datos

rental_ori=pd.read_csv('w3-database-project/data/rental.csv')

rental=rental_ori.copy()

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [76]:
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [77]:
for c in rental.select_dtypes('integer').columns:
    
    rental[c]=pd.to_numeric(rental[c], downcast='integer')
    
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int16
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int16
 3   customer_id   1000 non-null   int16
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int8
 6   last_update   1000 non-null   object
dtypes: int16(3), int8(1), object(3)
memory usage: 229.6 KB

In [78]:
nan_cols=rental.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [79]:
rental.drop_duplicates().shape==rental.shape

True

In [80]:
rental.to_csv('w3-database-project/data/rental.csv',sep=',',index=False)

In [ ]:
#comprobaciones relaciones